# Ultralytics YOLO 🚀, GPL-3.0 license

# Model Parameters
nc: 80  # Number of object classes

# Scaling Factors for Model Variants
# These control the depth and width multipliers for different YOLOv8 versions.

# YOLOv8-nano (v8n)
# depth_multiple: 0.33  # Controls the number of repeated modules
# width_multiple: 0.25  # Controls the number of convolutional channels

# YOLOv8-small (v8s)
depth_multiple: 0.33  # Controls module depth scaling
width_multiple: 0.50  # Controls convolutional channel scaling

# YOLOv8-medium (v8m)
# depth_multiple: 0.67  
# width_multiple: 0.75  

# YOLOv8-large (v8l)
# depth_multiple: 1.00  
# width_multiple: 1.00  

# YOLOv8-extra large (v8x)
# depth_multiple: 1.00  
# width_multiple: 1.25  


# Backbone Architecture
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 1, FCBT, [384]]


# Head Architecture
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]

  - [[16, 19, 22], 1, Detect, [nc]]